from langgraph.graph import START, StateGraph, END
from typing import TypedDict
from edge_tts import Communicate
import asyncio
from mutagen.id3 import ID3, USLT

class TTSState(TypedDict):
    text: str
    output_file: str
    status: str


async def generate_audio(state: TTSState):
    text = state["text"]
    communicate = Communicate(
        text=text,
        voice="hi-IN-SwaraNeural",
        rate="+0%"
        )
    
    filename = "test.mp3"
    await communicate.save(filename)

    return {
        "output_file": filename,
        "status": "Done"
    }

def embed_text(state: TTSState):
    text = state["text"]
    output_file = state["output_file"]

    audio = ID3()

    audio.add(
        USLT(
    encoding=3,
    lang="hin",
    desc="Lyrics",
    text=text
)
    )

    audio.save(output_file)

    return {
        "status": "Lyrics Embedded"
    }



graph = StateGraph(TTSState)

graph.add_node("generate_audio", generate_audio)
graph.add_node("embed_text", embed_text)

graph.add_edge(START, "generate_audio")
graph.add_edge("generate_audio", "embed_text")
graph.add_edge("embed_text", END)

workflow = graph.compile()


async def main():
    initial_state = {
        "text": """आप जिस भी प्रकार की लेखन शैली का उपयोग करते हैं, उसके अनुसार पैराग्राफ अलग-अलग होंगे। व्याख्यात्मक निबंध में, पैराग्राफ आम तौर पर सुव्यवस्थित कथन होते हैं, जिनमें कम से कम सात वाक्य होते हैं। लेकिन इनमें काफी भिन्नता हो सकती है। मूल नियम याद रखें: एक पैराग्राफ एक व्यक्तिगत विचार को दर्शाता है। लेकिन इसके अलावा, एक लेखक के रूप में, व्यक्तिगत विचार को परिभाषित करने में आपकी बहुत भूमिका होती है। अपने पाठक को आपके द्वारा दी जा रही जानकारी को समझने में मदद करने के बारे में सोचें। निबंधों में, बहुत सारे छोटे पैराग्राफ उन पाठकों के लिए थोड़े विचलित करने वाले हो सकते हैं जो बहुत अधिक स्पष्टीकरण चाहते हैं। अन्य प्रकार के लेखन में, छोटे पैराग्राफ उन लोगों के लिए वरदान साबित होते हैं जो जल्दी पढ़ना समाप्त करना चाहते हैं। मैं हमेशा से निबंध के मूल प्रारूप का समर्थक रहा हूँ: एक परिचय; एक मुख्य भाग; और एक निष्कर्ष। मेरे विचार से, परिचय और निष्कर्ष संक्षिप्त और सटीक होने चाहिए। इसलिए वे आम तौर पर अन्य पैराग्राफों से छोटे होते हैं। मेरे विचार से, मुख्य भाग पर्याप्त समर्थन के साथ अधिक प्रभावी होता है। जैसा कि मैंने कई बार कहा है, समर्थन के तीन पैराग्राफ पर्याप्त प्रतीत होते हैं। यदि प्रत्येक पैराग्राफ सात से दस वाक्यों का हो, तो एक मानक निबंध लगभग डेढ़ पृष्ठ का होगा। बेशक, मुझे शब्दों की गिनती करना पसंद नहीं है, इसलिए मैं वाक्यों और पैराग्राफों की गिनती का समर्थन नहीं करता। लेकिन यह सुनिश्चित करें कि आपके निबंध का प्रत्येक भाग (एक पैराग्राफ एक भाग होता है) इस प्रकार विकसित हो कि पाठक को जानकारी समझ में आए और वह संतुष्ट महसूस करे। निम्नलिखित अंश चार्ल्स डिकेंस द्वारा लिखित एक उपन्यास से लिया गया है। यह वास्तव में कई पैराग्राफों का है, लेकिन मैंने इसे एक बड़े पैराग्राफ के रूप में लिखा है। देखें कि क्या आप तय कर सकते हैं कि पैराग्राफों को कहाँ रखा जाना चाहिए और क्यों। यह मुझे अभी भी भावुक कर देता है, हालाँकि मैं इसे हल्के ढंग से कह रहा हूँ, यह याद करके कि मैं अपने खुशहाल घर को छोड़ने के लिए कितना उत्सुक था; यह सोचकर कि मुझे कितना कम अंदाजा था कि मैं हमेशा के लिए क्या छोड़ रहा हूँ। मुझे यह याद करके खुशी होती है कि जब मालवाहक की गाड़ी द्वार पर थी, और मेरी माँ वहाँ खड़ी मुझे चूम रही थी, तो उनके लिए और उस पुराने स्थान के लिए, जिसे मैंने पहले कभी नहीं छोड़ा था, कृतज्ञता और स्नेह ने मुझे रुला दिया। मुझे यह जानकर खुशी होती है कि मेरी माँ भी रोईं, और मैंने उनके दिल की धड़कन को अपने दिल से महसूस किया। मुझे याद करके खुशी होती है कि जब गाड़ी चलने लगी, तो मेरी माँ गेट से बाहर दौड़ीं और उसे रुकने के लिए कहा ताकि वह मुझे एक बार फिर चूम सकें। मुझे उस लगन और प्यार का एहसास याद करके खुशी होती है जिससे उन्होंने अपना चेहरा मेरी ओर उठाया और मुझे चूमा। जब हम उन्हें सड़क पर खड़ी छोड़कर जा रहे थे, तो श्री मर्डस्टोन उनके पास आए और उन्हें इतना भावुक होने पर डांटने लगे। मैं गाड़ी के शामियाने से पीछे मुड़कर देख रहा था और सोच रहा था कि उनका क्या काम है। पेगोट्टी, जो दूसरी तरफ से पीछे देख रहा था, बिल्कुल भी संतुष्ट नहीं लग रहा था; जैसा कि उसके चेहरे से पता चलता था जब वह गाड़ी में वापस आया। मैं कुछ देर तक पेगोट्टी को देखता रहा, इस अजीब मामले पर सोच रहा था; कि अगर उसे मुझे परियों की कहानी के लड़के की तरह गायब करने के लिए लगाया गया होता, तो क्या मैं उसके द्वारा गिराए गए बटनों से अपना रास्ता ढूंढकर वापस घर आ पाता।"""
    }
    
    result = await workflow.ainvoke(initial_state)

    print(result)

if __name__ == "__main__":
    asyncio.run(main())

